{
    "tag_name": "v8.32",
    "name": "Release 8.32",
    "body": "## What's Changed\r\n\r\n* **Windows:** Fix the issue that the minimize window button does not work on Windows 10.\r\n* Replace the `YEAR` tab in `Statistics` window with `OVERVIEW` tab which will analyze 40K commits at most instead of just most recent a year.\r\n* Remove the `MaxWidth` limitation of changes/files view in `CHANGES` and `FILES` tab.\r\n* Rewrite the way to launch this application as an SSH askpass client.\r\n* Fix the issue that SourceGit will delete `.git/rebase-merge` and `.git/rebase-apply` folder when rebasing is not happend in SourceGit.\r\n* **macOS:** Fix the issue that `LSEnvironment` sometimes not working\r\n* Now workspace will keep track of the order of opened repositories\r\n* When toggle a local branch filter, if it has a tracked upstream branch, do the same for the upstream branch\r\n* The `Auto-Fetch` setting has been moved from global preference to repository's configuration\r\n* Add `--merge` and `--keep` support to `git reset` command\r\n* Add an option to only show LFS objects locked by current git user\r\n* If current history commit filter list is not empty, auto add the checkout target branch (and its upstream) into it\r\n* Supports locking/unlocking LFS files from changes and revision files in commit details view\r\n* Supports search commits only in current branch\r\n* Change the hotkey of `Commit And Push` button to `Alt+Enter` (Windows/Linux) or `⌥+Enter` (macOS)\r\n* The hotkey `Ctrl+Alt+Enter` (Windows/Linux) or `⌘+Shift+Enter` (macOS) is used to stage all changes and then commit.\r\n* Fix the issue that the last line in `Blame` view can not be selected\r\n* Improve highlighted chunk selection in text diff view\r\n* Reduce `Minimum` of History Commits setting\r\n* Fix the issue that right-clicking multiple times before the context menu is opened may crash this application.\r\n* Improve the commit graph for orphan branches\r\n* Several other UI/UX changes.\r\n\r\n## New Contributors\r\n* @mat13109 made their first contribution in https://github.com/sourcegit-scm/sourcegit/pull/515\r\n* @Stern1710 made their first contribution in https://github.com/sourcegit-scm/sourcegit/pull/519\r\n* @AquariusStar made their first contribution in https://github.com/sourcegit-scm/sourcegit/pull/529\r\n\r\n**Full Changelog**: https://github.com/sourcegit-scm/sourcegit/compare/v8.31...v8.32"
}